tutorials/lagrangian/reactingParcelFilmFoam/panel/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/polyMesh";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.1;

vertices
(
    //back
    (  0  0  0)
    ( 1  0  0)
    ( 0  0.5  0)
    (  1  0.5  0)

    // front
    (  0  0  0.2)
    ( 1  0  0.2)
    ( 0  0.5  0.2)
    (  1  0.5  0.2)
);

blocks
(
    hex (0 1 3 2 4 5 7 6 ) (20 30 1) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    wall walls
    (
        (1 5 7 3)
        (4 5 7 6)
        (4 0 2 6)
        (7 3 2 6)
        (0 4 5 1)
    )
    wall filmWalls
    (
        (0 1 3 2)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
